def peregonka(a, b, c, f):

    #задаём размер системы
    n = len(f)

    #прямой ход
    #создаём массивы для альфы и беты
    alpha = [0.0]*n
    beta = [0.0]*n

    #считаем альфа2 и бета2
    alpha[0] = -c[0]/b[0]
    beta[0] = f[0]/b[0]

    #считаем остальные коэффиценты
    for i in range(1, n):
        den = b[i] + a[i]*alpha[i-1]
        alpha[i] = -c[i]/den
        beta[i] = (f[i]-a[i]*beta[i-1])/den
    #обратная прогонка
    #созда1м массив для x
    x = [0.0]*n

    #последний x равен посленей секретной бете, если присмотреться
    x[-1] = beta[-1]

    #считаем остальные иксы
    for i in range(n - 2, -1, -1):
        x[i] = alpha[i]*x[i+1] + beta[i]

    return x

#значения
a = [0, -1, -9, -1, 9]
b = [-6, 13, -15, -7, -18]
c = [5, 6, -4, 1, 0]
f = [51, 100, -12, 47, -90]

x = peregonka(a, b, c, f)

for i in range(len(x)):
    print( f"x_{i+1} = {x[i]}") 